{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "LogicApp_ChangesURL": {
            "type": "String"
        }
    },
    "variables": {},
    "resources": [
        {
            "type": "microsoft.operationalinsights/workspaces",
            "apiVersion": "2020-10-01",
            "name": "cabackup",
            "location": "[resourceGroup().location]",
            "properties": {
                "sku": {
                    "name": "pergb2018"
                },
                "retentionInDays": 30
            }
        },        

        {
            "type": "microsoft.insights/actionGroups",
            "apiVersion": "2019-06-01",
            "name": "CABackup",
            "location": "Global",
            "dependsOn": [
                "[resourceId('microsoft.operationalinsights/workspaces', 'cabackup')]"
            ],
            "properties": {
                "groupShortName": "CABackup",
                "enabled": true,                
                "logicAppReceivers": [
                    {
                        "name": "CA-Changes",
                        "resourceId": "[concat('/subscriptions/',subscription().subscriptionId,'/resourceGroups/',resourceGroup().name,'/providers/Microsoft.Logic/workflows/CA-Monitor-Changes')]",
                        "callbackUrl": "[parameters('LogicApp_ChangesURL')]",
                        "useCommonAlertSchema": true
                    }
                ]
            }
        },

        {
            "type":"Microsoft.Insights/scheduledQueryRules",
            "name":"CABackup-Changes",
            "apiVersion": "2018-04-16",
            "location": "[resourceGroup().location]",
            "dependsOn": [
                "[resourceId('microsoft.insights/actionGroups', 'CABackup')]"
            ],
            "properties":{
                "description": "",
                "enabled": "true",
                "source": {
                    "query": "AuditLogs | where OperationName == \"Update conditional access policy\" | extend userid_ = tostring(parse_json(tostring(InitiatedBy.user)).id) | where userid_ <> \"\"",
                    "authorizedResources": [
                    ],
                    "dataSourceId": "[concat('/subscriptions/',subscription().subscriptionId,'/resourceGroups/',resourceGroup().name,'/providers/Microsoft.OperationalInsights/workspaces/cabackup')]",
                    "queryType":"ResultCount"
                },
                "schedule":{
                    "frequencyInMinutes": 5,
                    "timeWindowInMinutes": 5
                },
                "action":{                    
                    "severity": "3",
                    "aznsAction":{
                        "actionGroup": [
                            "[resourceId('Microsoft.Insights/actionGroups', 'CABackup')]"
                        ]
                    },
                    "trigger":{
                        "thresholdOperator": "GreaterThan",
                        "threshold": 0
                    },
                    "odata.type": "Microsoft.WindowsAzure.Management.Monitoring.Alerts.Models.Microsoft.AppInsights.Nexus.DataContracts.Resources.ScheduledQueryRules.AlertingAction"
                }
            }
        }       
    ]
}